/*
 Navicat MySQL Data Transfer

 Source Server         : MySQL
 Source Server Type    : MySQL
 Source Server Version : 80018
 Source Host           : localhost:3306
 Source Schema         : shopping

 Target Server Type    : MySQL
 Target Server Version : 80018
 File Encoding         : 65001

 Date: 25/07/2024 14:30:59
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for projects
-- ----------------------------
DROP TABLE IF EXISTS `projects`;
CREATE TABLE `projects`  (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '公益项目id',
  `category` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '公益项目类别',
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '公益项目名称',
  `description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '公益项目描述',
  `image` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '公益项目图片',
  `create_time` datetime(6) NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 41 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of projects
-- ----------------------------
INSERT INTO `projects` VALUES (1, '扶贫捐赠', '希望工程', '由团中央、中国青少年基金会等组织发起的希望工程，旨在帮助贫困地区修建校舍、改善教学设施和提高教育质量，为贫困地区的儿童提供更好的学习条件。', '/assets/1001.jpg', '2024-07-13 10:02:48.000000');
INSERT INTO `projects` VALUES (2, '扶贫捐赠', '爱心助学行动', '由各地区政府或教育部门组织发起的爱心助学行动，旨在帮助贫困学生解决学费、学习用品等困难，同时鼓励社会各界人士积极参与，共同关注贫困地区的教育问题。', '/assets/1002.jpg', '2024-07-11 10:02:53.000000');
INSERT INTO `projects` VALUES (3, '扶贫捐赠', '扶贫阳光计划', '由中国扶贫儿童少年基金会发起的阳光计划，旨在关注和帮助贫困地区的儿童解决生活和学习上的困难，通过提供资金、物资和志愿者服务等方式，改善他们的成长环境。', '/assets/1003.jpg', '2024-07-24 00:12:59.000000');
INSERT INTO `projects` VALUES (4, '扶贫捐赠', '春蕾计划', '由中国妇女发展基金会发起的春蕾计划，旨在关注贫困地区女童的教育和健康问题，通过提供资金、物资和医疗救助等方式，帮助她们获得更好的成长机会。', '/assets/1004.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (5, '扶贫捐赠', '爱心助学基金', '由各企业或社会组织发起的爱心助学基金，例如天禾助学慈善基金会，旨在帮助贫困学生解决学费和生活费用等困难，同时鼓励员工或会员积极参与，共同关注贫困地区的教育问题。', '/assets/1005.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (6, '扶贫捐赠', '薇笑阳光计划', '薇诺娜携云南省红十字一行来到了昭通市大山包镇，与皮肤科专家张建波主任、媒体及公益大使们一起深入走访乡村集市开展义诊活动。', '/assets/1006.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (11, '动物慈善', '中国小动物保护协会：“99公益日”为流浪动物募捐粮食', '“99公益日”已开展了8个年头，已成为全民公益行动日之一。“99公益日”兼具平台优势与众多合者的鼎力支持，助力中国小动物保护协会搭建起联结受助人、捐助人、公益组织及项目、知名企业、知名人士和数亿用户的公益平台，不断唤起社会各界关心、参与动物救助公益事业的热情。', '/assets/2001.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (12, '动物慈善', '“流浪暂停计划”爱心领养日', '漫步街头，会有流浪的小天使经过，它们天真笨拙，明亮的眼睛里满是无助。每个生命的最初，都在期待中诞生。在成长中，它们或许曾被世界伤害过，但又满怀热爱。让我们汇集每一点小小的善意，一起营造一个最温暖的怀抱，去治愈流浪小动物所有过往的不安与伤害。', '/assets/2002.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (13, '动物慈善', '“清”年爱劳动 | 让生命不再流浪', '毛球儿俱乐部是中国生物多样性保护与绿色发展基金会“毛球儿回家项目”的发起与实施单位，北京康和公益基金会宠物与人类健康专项基金流浪动物救助爱心基地，中国出入境检验检疫协会宠物产业工作委员会下属唯一流浪动物领养中心，旨在推广公益领养、科学养宠。', '/assets/2003.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (14, '动物慈善', '生命至上，爱不流浪', '流浪动物的救助和领养是一个复杂、持久的命题，不仅需要一群人的全力以赴，更需要整个社会集体的力所能及。作为视爱宠为人类亲密伙伴的生骨肉配方专家品牌，帕特自然也是当仁不让、力所能及的一份子。帕特期望通过公益活动，帮助更多流浪动物改善生存环境，并从源头解决流浪动物问题，建立动物与人类之间更为亲密、自然、和睦的生活模式。', '/assets/2004.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (15, '动物慈善', '狐狸医生捐赠活动', '狐狸医生邀请到昆明南部动物医院的动物医生们一起，共同为云南小动物保护工作和爱心救助公益事业做宣传，进行现场救治。', '/assets/2005.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (16, '动物慈善', '汇聚力量，人宠和谐', '本次驱虫进校园系列公益活动由楷胜文化传媒公司主办，楷胜文化联合瑞鹏基金会共同开展，勃林格殷格翰提供冠名赞助的小动物科普教育行动，本活动含驱虫进校园、校园流浪动物免费派发驱虫药及“科学防治，构建人宠和谐社会”公益创新方案大赛三个活动，来提升高校学生对寄生虫及驱虫的认知；增加高校学生参与校园流浪动物的驱虫行动，及通过形式多样的公益创新方案，面向社会广泛开展健康教育，减少流浪动物寄生虫病及相关人兽共患病传播。', '/assets/2006.jpg', '2024-07-10 10:03:06.000000');
INSERT INTO `projects` VALUES (17, '动物慈善', '萌宠守护计划', '很多宠物面临着安全隐患，例如猫咪攀爬玩耍坠楼，狗狗趁开门间隙溜出遗失、以及遗失后寻找等情况，除了突发状况，日常宠物情感陪伴也存在需求。面对这些痛点，小豚当家通过智能的硬件设备，构建全方位立体的看护网络。在视频看护上，小豚当家智能家用摄像机可以让宠物主实现远程看护，宠物检测，对于宠物拆家或者危险行为，还可以通过远程通话及时的制止。', '/assets/2007.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (18, '动物慈善', '江安西苑猫猫绝育项目', '学校里有很多猫猫，为了猫猫的健康，需要等到小猫达到一定体重，然后去绝育。如果你每天看见小猫都很开心，献出你的爱心，帮小猫健康生活吧！', '/assets/2008.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (19, '动物慈善', '江安小猫救助', '大雨期间有一只猫在学校志愿者准备的猫窝里面生产了，但是因为志愿者在大雨期间没有及时发现小猫，小猫生病了，帮帮小猫，让他们快乐长大吧！', '/assets/2009.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (20, '动物慈善', '江安假期猫粮狗粮购买', '暑假期间，大多数同学们不在学校，现要筹备暑假期间学校的小动物的粮，有爱心的献爱心，在学校的帮忙志愿者们喂小猫🐱🐶', '/assets/2010.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (23, '环保活动', '川大垃圾分类项目', '四川大学垃圾分类公益项目致力于推广环保意识，通过教育和实践，鼓励校园内外的人们积极参与垃圾分类，共同营造绿色校园。', '/assets/3001.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (24, '环保活动', '软件学院环保宣传教育', '走进社区宣传环保知识，带领志愿者沿途清理垃圾，提高社区居民还有同学志愿者的环保意识，购买环保购物袋分发给社区居民', '/assets/3002.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (25, '环保活动', '江安河道垃圾清理项目', '旨在改善河道环境，提升生态质量的环保行动。根据搜索结果，可以看到各地针对河道垃圾问题采取了不同的措施和行动。', '/assets/3003.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (31, '助学项目', '“善行100活动”', '‌通过大学生周末参与的捐款活动，‌为贫困地区的孩子求捐，‌旨在消除他们的“冻人”烦恼，‌用温暖点燃孩子们的璀璨梦想。', '/assets/4001.jpg', '2024-07-18 10:02:59.000000');
INSERT INTO `projects` VALUES (32, '助学项目', '“助帮公益助学计划”', '旨在为因家庭经济困难而濒临失学的孩子提供定向资助。‌资助并引导那些孩子就读“学有所用”的专业，‌如护理专业，‌毕业后统一安置到医疗及养老机构从事医护/医养工作，‌实现“帮扶一个学生，‌脱贫一个家庭”的目标3。‌', '/assets/4002.jpg', '2024-07-11 10:02:53.000000');
INSERT INTO `projects` VALUES (33, '助学项目', '“为爱筑桥”公益行动项目', '该项目关爱帮扶对象定位精准，项目内容设计丰富，项目各方通力合作，形成了合力，通过实实在在的关爱举措，帮助困境儿童求学圆梦，让他们充分感受到党的关怀和社会主义大家庭的温暖。让更多乡村学校困难和困境儿童收获关爱与温暖。\r\n\r\n', '/assets/4003.jpg', '2024-07-11 10:02:53.000000');
INSERT INTO `projects` VALUES (34, '助学项目', '圆梦大学行动', '为了帮助困难家庭学生圆梦大学，助力国家对于优秀人才的培养。自2012年起，南平市闽北互动志愿者协会在高考结束之际都将启动“圆梦大学行动”项目，一直到现在。', '/assets/4004.jpg', '2024-07-11 10:02:53.000000');
INSERT INTO `projects` VALUES (35, '助学项目', '慈善圆梦大学', '十年寒窗，百日风雨，行遍书山，终化锦绣前程，然而家庭经济困难的子女在求学路途上走的是异常坚辛，一份份入学通知书成为了他们的沉重包袱。为了使更多的困难学子顺利入学，至今项目还在进行中', '/assets/4005.jpg', '2024-07-11 10:02:53.000000');

SET FOREIGN_KEY_CHECKS = 1;
